benchmarks/artillery/stress-test-local.yml
# Local / laptop profile — achievable on Docker Desktop (Windows)
config:
  target: "http://localhost:3000"
  http:
    timeout: 30
    pool: 500
  phases:
    - duration: 20
      arrivalRate: 20
      name: "Warm-up"
    - duration: 40
      arrivalRate: 100
      name: "Ramp-up"
    - duration: 60
      arrivalRate: 200
      name: "Sustained (200 rps)"
  defaults:
    headers:
      Authorization: "Bearer dev-api-key-1"
      Content-Type: "application/json"

scenarios:
  - name: "Health Check"
    weight: 70
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Metrics Scrape"
    weight: 15
    flow:
      - get:
          url: "/metrics"
          expect:
            - statusCode: 200

  - name: "Chat Completions with PII"
    weight: 12
    flow:
      - post:
          url: "/v1/chat/completions"
          headers:
            Idempotency-Key: "{{ $uuid }}"
          json:
            model: "gpt-4o-mini"
            messages:
              - role: "user"
                content: "Summarize: Name {{ $randomString() }} Smith, Email: {{ $randomString() }}@example.com, Phone: 555-{{ $randomNumber(100,999) }}-{{ $randomNumber(1000,9999) }}"
            max_tokens: 128
          expect:
            - statusCode: [200, 409, 429, 503]

  - name: "Idempotency Replay"
    weight: 3
    flow:
      - post:
          url: "/v1/chat/completions"
          headers:
            Idempotency-Key: "replay-{{ $randomNumber(1,50) }}"
          json:
            model: "gpt-4o-mini"
            messages:
              - role: "user"
                content: "Contact john.doe@corp.com"
            max_tokens: 64
          expect:
            - statusCode: [200, 409, 429, 503]